SELECT bti.MUN_RAYON district, bti.GOD_POSTR year, 
CASE WHEN bti.GOD_POSTR <= 1917                           THEN 'TRUE' ELSE ' ' END period_1,
CASE WHEN bti.GOD_POSTR >  1917 AND bti.GOD_POSTR <= 1935 THEN 'TRUE' ELSE ' ' END period_2,
CASE WHEN bti.GOD_POSTR >  1935 AND bti.GOD_POSTR <= 1957 THEN 'TRUE' ELSE ' ' END period_3,
CASE WHEN bti.GOD_POSTR >  1957 AND bti.GOD_POSTR <= 1970 THEN 'TRUE' ELSE ' ' END period_4,
CASE WHEN bti.GOD_POSTR >  1970 AND bti.GOD_POSTR <= 1991 THEN 'TRUE' ELSE ' ' END period_5,
CASE WHEN bti.GOD_POSTR >  1991 AND bti.GOD_POSTR <= 2014 THEN 'TRUE' ELSE ' ' END period_6
FROM BUILDSEQ.BTI_CHAR_TURNED3 bti
WHERE bti.KLASS_STROEN = 'жилые' 
AND bti.GOD_POSTR IS NOT NULL AND bti.GOD_POSTR != 0
AND bti.MUN_RAYON IN ('Академический','Алексеевский','Алтуфьевский','Арбат','Аэропорт','Бабушкинский','Басманный','Беговой','Бескудниковский','Бибирево',
'Бирюлево Восточное','Бирюлево Западное','Богородское','Братеево','Бутырский','Вешняки','Войковский','Восточное Дегунино','Восточное Измайлово','Восточный',
'Выхино-Жулебино','Гагаринский','Головинский','Гольяново','Даниловский','Дмитровский','Донской','Дорогомилово','Замоскворечье','Западное Дегунино',
'Зюзино','Зябликово','Ивановское','Измайлово','Капотня','Коньково','Коптево','Косино-Ухтомский','Котловка','Красносельский',
'Крылатское','Крюково','Кузьминки','Кунцево','Куркино','Левобережный','Лефортово','Лианозово','Ломоносовский','Лосиноостровский',
'Люблино','Марфино','Марьина Роща','Марьино','Матушкино','Метрогородок','Мещанский','Митино','Можайский','Молжаниновский',
'Москворечье-Сабурово','Нагатино-Садовники','Нагатинский Затон','Нагорный','Некрасовка','Нижегородский','Ново-Переделкино','Новогиреево','Новокосино','Обручевский',
'Орехово-Борисово Северное','Орехово-Борисово Южное','Останкинский','Отрадное','Очаково-Матвеевское','Перово','Печатники','Покровское-Стрешнево','Преображенское','Пресненский',
'Проспект Вернадского','Раменки','Ростокино','Рязанский','Савелки','Савеловский','Свиблово','Северное Бутово','Северное Измайлово','Северное Медведково',
'Северное Тушино','Северный','Силино','Сокол','Соколиная Гора','Сокольники','Солнцево','Старое Крюково','Строгино','Таганский',
'Тверской','Текстильщики','Теплый Стан','Тимирязевский','Тропарево-Никулино','Филевский Парк','Фили-Давыдково','Хамовники','Ховрино','Хорошево-Мневники',
'Хорошевский','Царицыно','Черемушки','Чертаново Северное','Чертаново Центральное','Чертаново Южное','Щукино','Южное Бутово','Южное Медведково','Южное Тушино',
'Южнопортовый','Якиманка','Ярославский','Ясенево')
AND ( --1 подусловие состояния должны быть не равны (или не тождественны) следующим значениям
 ((bti.SOST_STROEN <> '-Часть до объединения (ЧдО)')
  AND (bti.SOST_STROEN <> '-Целое до деления (ЦдР)')
  AND (bti.SOST_STROEN NOT LIKE '%Удалено%')
  AND (bti.SOST_STROEN <> '-Новостройка как часть до объединения')
  AND (bti.SOST_STROEN <> '-Удалено как самостоятельное строение')
  AND (bti.SOST_STROEN <> '-Ошибочный ввод ст/к')
  AND (bti.SOST_STROEN <> '-Самовольно возведенное строение без техпаспорта')
  AND (bti.SOST_STROEN <> '-Объект, незавершенный строительством')
  AND (bti.SOST_STROEN <> '-Удалено как дубликат')
  AND (bti.SOST_STROEN <> '-Погибло или уничтожено')
  AND (bti.SOST_STROEN <> 'Объединение ранее учтенных (Объ)')
  AND (bti.SOST_STROEN <> 'Деление ранее учтенного (Дел)')
  AND (bti.SOST_STROEN <> '+-Перевод в нежилое строение (Ж-Н)') --только для жилья
  AND (bti.SOST_STROEN NOT LIKE '%Списано%')
  AND (bti.SOST_STROEN NOT LIKE '%Проект%')
  AND (bti.SOST_STROEN NOT LIKE '%Ошибочный ввод%')
  AND (bti.SOST_STROEN NOT LIKE '%Самовольно%')
  AND (bti.SOST_STROEN NOT LIKE '%Подготовка технического%')
  AND (bti.SOST_STROEN NOT LIKE '%Исключено%')
  AND (bti.SOST_STROEN NOT LIKE '%Строение без%')
  AND (bti.SOST_STROEN NOT LIKE '%Снос%')
) OR (bti.SOST_STROEN IS NULL) --2 подусловие состояние может быть равно нул
--3 подусловие- состояние сноса верно только тогда когда дата сноса больше даты среза среза , 
--т.к. дома снесенные после даты среза ещё стояли до даты среза
OR ((bti.SOST_STROEN LIKE '%Снос%') AND (TO_DATE(bti.DATA_SOST,'DD.MM.YYYY') > TO_DATE('31.12.2020','DD.MM.YYYY')))
)
ORDER BY district, year;

SELECT district, COUNT(period_6) period_6
FROM (
SELECT bti.MUN_RAYON district, bti.GOD_POSTR year, 
CASE WHEN bti.GOD_POSTR <= 1917                           THEN 'TRUE' ELSE ' ' END period_1,
CASE WHEN bti.GOD_POSTR >  1917 AND bti.GOD_POSTR <= 1935 THEN 'TRUE' ELSE ' ' END period_2,
CASE WHEN bti.GOD_POSTR >  1935 AND bti.GOD_POSTR <= 1957 THEN 'TRUE' ELSE ' ' END period_3,
CASE WHEN bti.GOD_POSTR >  1957 AND bti.GOD_POSTR <= 1970 THEN 'TRUE' ELSE ' ' END period_4,
CASE WHEN bti.GOD_POSTR >  1970 AND bti.GOD_POSTR <= 1991 THEN 'TRUE' ELSE ' ' END period_5,
CASE WHEN bti.GOD_POSTR >  1991 AND bti.GOD_POSTR <= 2014 THEN 'TRUE' ELSE ' ' END period_6
FROM BUILDSEQ.BTI_CHAR_TURNED3 bti
WHERE bti.KLASS_STROEN = 'жилые' 
AND bti.GOD_POSTR IS NOT NULL AND bti.GOD_POSTR != 0
AND bti.MUN_RAYON IN ('Академический','Алексеевский','Алтуфьевский','Арбат','Аэропорт','Бабушкинский','Басманный','Беговой','Бескудниковский','Бибирево',
'Бирюлево Восточное','Бирюлево Западное','Богородское','Братеево','Бутырский','Вешняки','Войковский','Восточное Дегунино','Восточное Измайлово','Восточный',
'Выхино-Жулебино','Гагаринский','Головинский','Гольяново','Даниловский','Дмитровский','Донской','Дорогомилово','Замоскворечье','Западное Дегунино',
'Зюзино','Зябликово','Ивановское','Измайлово','Капотня','Коньково','Коптево','Косино-Ухтомский','Котловка','Красносельский',
'Крылатское','Крюково','Кузьминки','Кунцево','Куркино','Левобережный','Лефортово','Лианозово','Ломоносовский','Лосиноостровский',
'Люблино','Марфино','Марьина Роща','Марьино','Матушкино','Метрогородок','Мещанский','Митино','Можайский','Молжаниновский',
'Москворечье-Сабурово','Нагатино-Садовники','Нагатинский Затон','Нагорный','Некрасовка','Нижегородский','Ново-Переделкино','Новогиреево','Новокосино','Обручевский',
'Орехово-Борисово Северное','Орехово-Борисово Южное','Останкинский','Отрадное','Очаково-Матвеевское','Перово','Печатники','Покровское-Стрешнево','Преображенское','Пресненский',
'Проспект Вернадского','Раменки','Ростокино','Рязанский','Савелки','Савеловский','Свиблово','Северное Бутово','Северное Измайлово','Северное Медведково',
'Северное Тушино','Северный','Силино','Сокол','Соколиная Гора','Сокольники','Солнцево','Старое Крюково','Строгино','Таганский',
'Тверской','Текстильщики','Теплый Стан','Тимирязевский','Тропарево-Никулино','Филевский Парк','Фили-Давыдково','Хамовники','Ховрино','Хорошево-Мневники',
'Хорошевский','Царицыно','Черемушки','Чертаново Северное','Чертаново Центральное','Чертаново Южное','Щукино','Южное Бутово','Южное Медведково','Южное Тушино',
'Южнопортовый','Якиманка','Ярославский','Ясенево')
AND ( --1 подусловие состояния должны быть не равны (или не тождественны) следующим значениям
 ((bti.SOST_STROEN <> '-Часть до объединения (ЧдО)')
  AND (bti.SOST_STROEN <> '-Целое до деления (ЦдР)')
  AND (bti.SOST_STROEN NOT LIKE '%Удалено%')
  AND (bti.SOST_STROEN <> '-Новостройка как часть до объединения')
  AND (bti.SOST_STROEN <> '-Удалено как самостоятельное строение')
  AND (bti.SOST_STROEN <> '-Ошибочный ввод ст/к')
  AND (bti.SOST_STROEN <> '-Самовольно возведенное строение без техпаспорта')
  AND (bti.SOST_STROEN <> '-Объект, незавершенный строительством')
  AND (bti.SOST_STROEN <> '-Удалено как дубликат')
  AND (bti.SOST_STROEN <> '-Погибло или уничтожено')
  AND (bti.SOST_STROEN <> 'Объединение ранее учтенных (Объ)')
  AND (bti.SOST_STROEN <> 'Деление ранее учтенного (Дел)')
  AND (bti.SOST_STROEN <> '+-Перевод в нежилое строение (Ж-Н)') --только для жилья
  AND (bti.SOST_STROEN NOT LIKE '%Списано%')
  AND (bti.SOST_STROEN NOT LIKE '%Проект%')
  AND (bti.SOST_STROEN NOT LIKE '%Ошибочный ввод%')
  AND (bti.SOST_STROEN NOT LIKE '%Самовольно%')
  AND (bti.SOST_STROEN NOT LIKE '%Подготовка технического%')
  AND (bti.SOST_STROEN NOT LIKE '%Исключено%')
  AND (bti.SOST_STROEN NOT LIKE '%Строение без%')
  AND (bti.SOST_STROEN NOT LIKE '%Снос%')
) OR (bti.SOST_STROEN IS NULL) --2 подусловие состояние может быть равно нул
--3 подусловие- состояние сноса верно только тогда когда дата сноса больше даты среза среза , 
--т.к. дома снесенные после даты среза ещё стояли до даты среза
OR ((bti.SOST_STROEN LIKE '%Снос%') AND (TO_DATE(bti.DATA_SOST,'DD.MM.YYYY') > TO_DATE('31.12.2020','DD.MM.YYYY')))
)
ORDER BY district, year)
WHERE period_6 = 'TRUE'
GROUP BY district
ORDER BY district;

SELECT distinct KLASS_STROEN
FROM BUILDSEQ.BTI_CHAR_TURNED3;

SELECT distinct MUN_RAYON
FROM BUILDSEQ.BTI_CHAR_TURNED3
ORDER BY MUN_RAYON;

SELECT distinct GOD_POSTR
FROM BUILDSEQ.BTI_CHAR_TURNED3;

SELECT count(bti.MUN_RAYON) district, 
bti.GOD_POSTR year
FROM BUILDSEQ.BTI_CHAR_TURNED3 bti
WHERE bti.KLASS_STROEN = 'жилые'
AND bti.GOD_POSTR IS NOT NULL AND bti.GOD_POSTR != 0 
GROUP BY bti.GOD_POSTR
ORDER BY year;

SELECT bti.MUN_RAYON district, count(bti.GOD_POSTR) year
FROM BUILDSEQ.BTI_CHAR_TURNED3 bti
WHERE bti.KLASS_STROEN = 'жилые'
AND bti.GOD_POSTR IS NOT NULL AND bti.GOD_POSTR != 0
AND bti.MUN_RAYON IN ('Академический','Алексеевский','Алтуфьевский','Арбат','Аэропорт','Бабушкинский','Басманный','Беговой','Бескудниковский','Бибирево',
'Бирюлево Восточное','Бирюлево Западное','Богородское','Братеево','Бутырский','Вешняки','Войковский','Восточное Дегунино','Восточное Измайлово','Восточный',
'Выхино-Жулебино','Гагаринский','Головинский','Гольяново','Даниловский','Дмитровский','Донской','Дорогомилово','Замоскворечье','Западное Дегунино',
'Зюзино','Зябликово','Ивановское','Измайлово','Капотня','Коньково','Коптево','Косино-Ухтомский','Котловка','Красносельский',
'Крылатское','Крюково','Кузьминки','Кунцево','Куркино','Левобережный','Лефортово','Лианозово','Ломоносовский','Лосиноостровский',
'Люблино','Марфино','Марьина Роща','Марьино','Матушкино','Метрогородок','Мещанский','Митино','Можайский','Молжаниновский',
'Москворечье-Сабурово','Нагатино-Садовники','Нагатинский Затон','Нагорный','Некрасовка','Нижегородский','Ново-Переделкино','Новогиреево','Новокосино','Обручевский',
'Орехово-Борисово Северное','Орехово-Борисово Южное','Останкинский','Отрадное','Очаково-Матвеевское','Перово','Печатники','Покровское-Стрешнево','Преображенское','Пресненский',
'Проспект Вернадского','Раменки','Ростокино','Рязанский','Савелки','Савеловский','Свиблово','Северное Бутово','Северное Измайлово','Северное Медведково',
'Северное Тушино','Северный','Силино','Сокол','Соколиная Гора','Сокольники','Солнцево','Старое Крюково','Строгино','Таганский',
'Тверской','Текстильщики','Теплый Стан','Тимирязевский','Тропарево-Никулино','Филевский Парк','Фили-Давыдково','Хамовники','Ховрино','Хорошево-Мневники',
'Хорошевский','Царицыно','Черемушки','Чертаново Северное','Чертаново Центральное','Чертаново Южное','Щукино','Южное Бутово','Южное Медведково','Южное Тушино',
'Южнопортовый','Якиманка','Ярославский','Ясенево')
AND ( --1 подусловие состояния должны быть не равны (или не тождественны) следующим значениям
 ((bti.SOST_STROEN <> '-Часть до объединения (ЧдО)')
  AND (bti.SOST_STROEN <> '-Целое до деления (ЦдР)')
  AND (bti.SOST_STROEN NOT LIKE '%Удалено%')
  AND (bti.SOST_STROEN <> '-Новостройка как часть до объединения')
  AND (bti.SOST_STROEN <> '-Удалено как самостоятельное строение')
  AND (bti.SOST_STROEN <> '-Ошибочный ввод ст/к')
  AND (bti.SOST_STROEN <> '-Самовольно возведенное строение без техпаспорта')
  AND (bti.SOST_STROEN <> '-Объект, незавершенный строительством')
  AND (bti.SOST_STROEN <> '-Удалено как дубликат')
  AND (bti.SOST_STROEN <> '-Погибло или уничтожено')
  AND (bti.SOST_STROEN <> 'Объединение ранее учтенных (Объ)')
  AND (bti.SOST_STROEN <> 'Деление ранее учтенного (Дел)')
  AND (bti.SOST_STROEN <> '+-Перевод в нежилое строение (Ж-Н)') --только для жилья
  AND (bti.SOST_STROEN NOT LIKE '%Списано%')
  AND (bti.SOST_STROEN NOT LIKE '%Проект%')
  AND (bti.SOST_STROEN NOT LIKE '%Ошибочный ввод%')
  AND (bti.SOST_STROEN NOT LIKE '%Самовольно%')
  AND (bti.SOST_STROEN NOT LIKE '%Подготовка технического%')
  AND (bti.SOST_STROEN NOT LIKE '%Исключено%')
  AND (bti.SOST_STROEN NOT LIKE '%Строение без%')
  AND (bti.SOST_STROEN NOT LIKE '%Снос%')
) OR (bti.SOST_STROEN IS NULL) --2 подусловие состояние может быть равно нул
--3 подусловие- состояние сноса верно только тогда когда дата сноса больше даты среза среза , 
--т.к. дома снесенные после даты среза ещё стояли до даты среза
OR ((bti.SOST_STROEN LIKE '%Снос%') AND (TO_DATE(bti.DATA_SOST,'DD.MM.YYYY') > TO_DATE('31.12.2020','DD.MM.YYYY')))
)
GROUP BY bti.MUN_RAYON
ORDER BY district;





SELECT count(*)
FROM BUILDSEQ.BTI_CHAR_TURNED3 bti
WHERE bti.KLASS_STROEN = 'жилые';

